tutorials/multiphaseEuler/pipeBend/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nCorrectors     1;
        nSubCycles      polynomial (0 3);
        implicitPhasePressure yes;
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(h|e).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
        maxIter         10;
    }

    "(k|epsilon).*"
    {
        solver            PBiCGStab;
        preconditioner    DILU;
        tolerance         1e-5;
        relTol            0;
        minIter           1;
    }

    "f.*"
    {
        solver            PBiCGStab;
        preconditioner    DILU;
        tolerance         1e-6;
        relTol            0;
    }

    agglomerates
    {
        nCorrectors          1;
        tolerance            1e-4;
        scale                true;
        solveOnFinalIterOnly true;
        sourceUpdateInterval 1;
    }
}

PIMPLE
{
    nOuterCorrectors         3;
    nCorrectors              2;
    nNonOrthogonalCorrectors 0;
    alphaSpreadMin           5e-4;
    alphaSpreadMax           0.9995;

    faceMomentum        no;
    VmDdtCorrection     yes;
    dragCorrection      yes;
}

relaxationFactors
{}


// ************************************************************************* //
